Documents/АР17_ИнформационныйДокумент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>АР17_ИнформационныйДокумент</Name>
			<BasedOn>
				<xr:Item>Document.АР17_ЗаключениеДоговораАренды</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АР_ПереданныеДокументы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Передан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возвращен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеДоговораАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АР_Москва</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АР_СанктПетербург</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_СтатусДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EMail</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КонтактныеЛица</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиКонтактныхЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтактногоЛица</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКонтактныхЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательЛичногоКонтакта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лид</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НекачественныйЛид</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/АР17_ИнформационныйДокумент/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ДокументОснованиеПриИзмененииНаСервере()

	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ЗаполнитьЗначенияСвойств(Объект, Объект.ДокументОснование, "ДоговорКонтрагента,Организация,Контрагент");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	ДокументОснованиеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Заголовок = Объект.Номер;
	//Объект.Ответственный =ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЭтаФорма.Заголовок = Объект.Номер;
	АР_ОбщиеПроцедуры.УстановкаПризнакаСПбМоскваДляДокумента(ТекущийОбъект, ПараметрыЗаписи.РежимЗаписи);   // + NAI Becar Конюшок С.Н. от 12.01.2017 09:40 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	АР_ОбщиеПроцедуры.УстановкаПризнакаСПбМоскваДляДокумента(ТекущийОбъект, ПараметрыЗаписи.РежимЗаписи);   // + NAI Becar Конюшок С.Н. от 12.01.2017 09:40 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоИК(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ИК) Тогда Предупреждение("Не выбран ИК!"); Возврат; КонецЕсли;
	
	Если Объект.Получатели.Количество() > 0 Тогда
		
		ТекстВопроса = "Табличные части: ""Получатели"" будут очищены и заполнены заново!";
		ПараметрыВопроса = Новый Структура("Заполнить", Истина);
		Оповещение = Новый ОписаниеОповещения("ПерезаполнитьОтвет", ЭтаФорма, ПараметрыВопроса);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		
	Иначе
		
		ЗаполнитьНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьОтвет(Знач Результат, ПараметрыВопроса) Экспорт
	
	Если ПараметрыВопроса.Свойство("Заполнить") И ПараметрыВопроса.Заполнить Тогда
		Если Результат = КодВозвратаДиалога.Да Тогда
			
			ЗаполнитьНаСервере();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.Получатели.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать РАЗЛИЧНЫЕ Док.Контрагент Из Документ.АР17_ЗаключениеДоговораАренды КАК Док Где Док.Проведен И Док.ИК = &ИК Упорядочить По Док.Контрагент";
	Запрос.УстановитьПараметр("ИК", Объект.ИК);
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Объект.Получатели.Загрузить(Рез);
	
	Для Каждого Стр Из Объект.Получатели Цикл
		
		Email = "";
		КонтактныеЛица = Справочники.КонтактныеЛица.СписокКонтактныхЛиц(Стр.Контрагент);
		Для Каждого СтрКЛ из КонтактныеЛица Цикл
			Если СтрКЛ.Значение.КонтактнаяИнформация.Количество()>0 Тогда
				Email = Email + ?(Email = "","",",") + 
				СтрКЛ.Значение.КонтактнаяИнформация[0].АдресЭП;	
			КонецЕсли;	
		КонецЦикла;
		
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Стр.Контрагент);
		
		КонтактнаяИнформацияОбъекта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивОбъектов,, Справочники.ВидыКонтактнойИнформации.EmailКонтрагенты, Неопределено);
		
		Для Каждого КИ Из КонтактнаяИнформацияОбъекта Цикл
			
			Если СокрЛП(КИ.Представление) <> "" Тогда
				
				Email = Email + ?(Email = "","",",") + 
				СокрЛП(КИ.Представление);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Стр.Email = Email;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя <> "ПолучателиДатаОтправки" Тогда
	
		Если Элемент.ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
		
		Если СокрЛП(Элемент.ТекущиеДанные.EMail) = "" Тогда Возврат; КонецЕсли;
		
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДатаОтправки) Тогда  Возврат; КонецЕсли;
		
		Элемент.ТекущиеДанные.Выбран = Не Элемент.ТекущиеДанные.Выбран;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиДатаОтправкиПриИзменении(Элемент)
	
	Если Элементы.Получатели.ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	Если Элементы.Получатели.ТекущиеДанные.Выбран И ЗначениеЗаполнено(Элементы.Получатели.ТекущиеДанные.ДатаОтправки) Тогда
		
		Элементы.Получатели.ТекущиеДанные.Выбран = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для Каждого Стр Из Объект.Получатели Цикл
		
		Если ЗначениеЗаполнено(СокрЛП(Стр.EMail)) И Не ЗначениеЗаполнено(Стр.ДатаОтправки) Тогда
			
			Стр.Выбран = Истина;
			
		Иначе
			
			Стр.Выбран = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьма(Команда)
	
	ОтправитьПисьмаНаСервере();
	
	Сообщить("Письма отправлены");
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПисьмаНаСервере()
	
	Для Каждого Стр Из Объект.Получатели Цикл
		
		Если Стр.Выбран И ЗначениеЗаполнено(СокрЛП(Стр.EMail)) Тогда
			
			ОтправитьПисьмо(Стр);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЭтотОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПисьмо(Стр)
	
	Попытка
		
		Профиль						=	Новый ИнтернетПочтовыйПрофиль;
		Профиль.АдресСервераSMTP 	=	"172.17.1.248";
			
		Сообщение 					=	Новый ИнтернетПочтовоеСообщение;
		Сообщение.Отправитель		=	"adminskolkovo@becar-group.com";
		Сообщение.Тема				=	Объект.Наименование;
		Сообщение.Тексты.Добавить(Объект.Текст);
			
		Если Найти(Стр.Email,",")>0 Тогда
			МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр.Email, ",");
			Для Каждого СтрМассива Из МассивСтрок Цикл
				Если СтрМассива <> "" Тогда
					Сообщение.Получатели.Добавить(СтрМассива);
				КонецЕсли;	
			КонецЦикла;	
		Иначе
			Сообщение.Получатели.Добавить(Стр.Email);
		КонецЕсли;
		
		// Получим прикрепленные файлы
		Запрос = Новый Запрос("Выбрать Спр.Ссылка Из Справочник.АР17_ИнформационныйДокументПрисоединенныеФайлы КАК Спр Где Спр.ВладелецФайла = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Рез = Запрос.Выполнить().Выбрать();
		Пока Рез.Следующий() Цикл
			
			//ДвДанные = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(Рез.Ссылка);
			
			//Сообщение.Вложения.Добавить(ДвДанные);
			
			Сообщение.Вложения.Добавить(Рез.Ссылка.Том.ПолныйПутьWindows + Рез.Ссылка.ПутьКФайлу, Рез.Ссылка.Наименование);
			
		КонецЦикла;
		
		ИнтернетПочта = Новый ИнтернетПочта;
		ИнтернетПочта.Подключиться(Профиль);
		ИнтернетПочта.Послать(Сообщение);
		ИнтернетПочта.Отключиться();
		
		Стр.ДатаОтправки			=	ТекущаяДата();
		Стр.Выбран					=	Ложь;
		
	Исключение
		
		Стр.ДатаОтправки			=	Дата('00010101');
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметку(Команда)
	
	Для Каждого Стр Из Объект.Получатели Цикл
		
		Стр.Выбран = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры
